In [2]:
import pandas as pd
d={'name':['shubham','Adin','Rahul'],
  'age':[23,28,30]}
Q1=pd.DataFrame(d)
display(Q1)
df={'name':['Amrit','shubham','Ali'],
  'age':[20,23,28]}
Q2=pd.DataFrame(df)
display(Q2)

      name  age
0  shubham   23
1     Adin   28
2    Rahul   30

      name  age
0    Amrit   20
1  shubham   23
2      Ali   28

In [16]:
df1 = pd.concat([Q1, Q2]).drop_duplicates()
df3 = df3.reset_index(drop=True)
df1

      name  age
0  shubham   23
1     Adin   28
2    Rahul   30
0    Amrit   20
2      Ali   28